Ran Plan for dir: `terraform-example-aws` workspace: `default`

<details><summary>Show Output</summary>

```diff

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_instance.web_app will be created
+ resource "aws_instance" "web_app" {
      + ami                          = "ami-674cbc1e"
      + arn                          = (known after apply)
      + associate_public_ip_address  = (known after apply)
      + availability_zone            = (known after apply)
      + cpu_core_count               = (known after apply)
      + cpu_threads_per_core         = (known after apply)
      + get_password_data            = false
      + host_id                      = (known after apply)
      + id                           = (known after apply)
      + instance_state               = (known after apply)
      + instance_type                = "m5.4xlarge"
      + ipv6_address_count           = (known after apply)
      + ipv6_addresses               = (known after apply)
      + key_name                     = (known after apply)
      + outpost_arn                  = (known after apply)
      + password_data                = (known after apply)
      + placement_group              = (known after apply)
      + primary_network_interface_id = (known after apply)
      + private_dns                  = (known after apply)
      + private_ip                   = (known after apply)
      + public_dns                   = (known after apply)
      + public_ip                    = (known after apply)
      + secondary_private_ips        = (known after apply)
      + security_groups              = (known after apply)
      + source_dest_check            = true
      + subnet_id                    = (known after apply)
      + tenancy                      = (known after apply)
      + vpc_security_group_ids       = (known after apply)

      + ebs_block_device {
          + delete_on_termination = true
          + device_name           = "my_data"
          + encrypted             = (known after apply)
          + iops                  = 800
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = 1000
          + volume_type           = "io1"
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = true
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = 50
          + volume_type           = (known after apply)
        }
    }

  # aws_lambda_function.hello_world will be created
+ resource "aws_lambda_function" "hello_world" {
      + arn                            = (known after apply)
      + function_name                  = "hello_world"
      + handler                        = "exports.test"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 1024
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:lambda:us-east-1:account-id:resource-id"
      + runtime                        = "nodejs12.x"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + timeout                        = 3
      + version                        = (known after apply)

      + tracing_config {
          + mode = (known after apply)
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

#####
Running Infracost atlantis_diff.sh in debug mode, remove atlantis_debug=true from Atlantis configs to disable debug outputs.

Running infracost on current branch using:
  $ infracost --no-color --usage-file infracost-usage.yml
time="2021-02-08T22:25:30Z" level=info msg="Loading resources from current directory"
time="2021-02-08T22:25:30Z" level=info msg="starting: Running terraform plan"
time="2021-02-08T22:25:30Z" level=info msg="Running command: /usr/local/bin/terraform plan -input=false -lock=false -no-color -out=/tmp/tfplan393155357"
time="2021-02-08T22:25:33Z" level=info msg="starting: Running terraform show"
time="2021-02-08T22:25:33Z" level=info msg="Running command: /usr/local/bin/terraform show -no-color -json /tmp/tfplan393155357"
time="2021-02-08T22:25:34Z" level=info msg="starting: Calculating cost estimate"
current_branch_monthly_cost is 1179.31
Checking out previous commit on current branch to handle Atlantis merge checkout-strategy.
Note: switching to 'HEAD~1'.

You are in 'detached HEAD' state. You can look around, make experimental
changes and commit them, and you can discard any commits you make in this
state without impacting any branches by switching back to a branch.

If you want to create a new branch to retain commits you create, you may
do so (now or later) by using -c with the switch command. Example:

  git switch -c <new-branch-name>

Or undo this operation with:

  git switch -

Turn off this advice by setting config variable advice.detachedHead to false

HEAD is now at bfd7dc5 feat: update integration to use infracost v0.7.17
Switching to default branch
commit bfd7dc53864b84eb4eea77e4afc7e248341ea9a3
Author: Ali <alikhajeh1@googlemail.com>
Date:   Sun Feb 7 20:23:09 2021 +0000

    feat: update integration to use infracost v0.7.17
Running infracost on default branch using:
  $ infracost --no-color --usage-file infracost-usage.yml
time="2021-02-08T22:25:34Z" level=info msg="Loading resources from current directory"
time="2021-02-08T22:25:34Z" level=info msg="starting: Running terraform plan"
time="2021-02-08T22:25:34Z" level=info msg="Running command: /usr/local/bin/terraform plan -input=false -lock=false -no-color -out=/tmp/tfplan106626573"
time="2021-02-08T22:25:36Z" level=info msg="starting: Running terraform show"
time="2021-02-08T22:25:36Z" level=info msg="Running command: /usr/local/bin/terraform show -no-color -json /tmp/tfplan106626573"
time="2021-02-08T22:25:37Z" level=info msg="starting: Calculating cost estimate"
default_branch_monthly_cost is 1185.81
#####

Infracost estimate: monthly cost will decrease by .5500% (default branch $1185.81 vs current branch $1179.31)

--- a/default_branch_infracost.txt
+++ b/current_branch_infracost.txt
+  NAME                                         MONTHLY QTY  UNIT         PRICE   HOURLY COST  MONTHLY COST   
 
   aws_instance.web_app                                                                                      
   ├─ Linux/UNIX usage (on-demand, m5.4xlarge)          730  hours        0.7680       0.7680      560.6400  
@@ -7,12 +7,12 @@
   │  └─ General Purpose SSD storage (gp2)               50  GB-months    0.1000       0.0068        5.0000  
   └─ ebs_block_device[0]                       
      ├─ Provisioned IOPS SSD storage (io1)           1,000  GB-months    0.1250       0.1712      125.0000  
-     └─ Provisioned IOPS                               900  IOPS-months  0.0650       0.0801       58.5000  
-  Total                                                                               1.0262      749.1400  
+     └─ Provisioned IOPS                               800  IOPS-months  0.0650       0.0712       52.0000  
+  Total                                                                               1.0173      742.6400  
                                                                                                             
   aws_lambda_function.hello_world                                                                           
   ├─ Requests                                          100  1M requests  0.2000       0.0274       20.0000  
   └─ Duration                                   25,000,000  GB-seconds    2e-05       0.5708      416.6675  
   Total                                                                               0.5982      436.6675  
                                                                                                             
-  OVERALL TOTAL (USD)                                                                 1.6244    1,185.8075  
+  OVERALL TOTAL (USD)                                                                 1.6155    1,179.3075  

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d terraform-example-aws`
* :put_litter_in_its_place: To **delete** this plan click [here](http://13b9ae9e3dd7:4141/lock?id=infracost%252Finfracost-atlantis%252Fterraform-example-aws%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d terraform-example-aws`
</details>

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
